lib/tasks/korona_store_scheduler.rake

SELECT "product_payloads".* FROM "product_payloads"
---
task :syncing_korona_po => :environment do
  if Date.today.wday == 2 && (3..11).to_a.include?(Time.now.utc.hour)
    next
  end
  # byebug
  product_payload_variants = []
  matched_korona_product = []
  p_payload = ProductPayload.all
  p_payload.each do |p|

SELECT "shopify_apis".* FROM "shopify_apis" ORDER BY "shopify_apis"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
task :korona_variants_syncing => :environment do
  next if Date.today.wday == 2 && (3..11).to_a.include?(Time.now.utc.hour)
  s = ShopifyApi.last

SELECT "shopify_apis".* FROM "shopify_apis" ORDER BY "shopify_apis"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "product_payloads".* FROM "product_payloads" WHERE "product_payloads"."processed" = $1  [["processed", false]]
SELECT "base_products".* FROM "base_products" WHERE "base_products"."shopify_product_id" = $1 AND "base_products"."shopify_variant_id" = $2 LIMIT $3  [["shopify_product_id", "6876540010548"], ["shopify_variant_id", "40467352911924"], ["LIMIT", 1]]
---
task :process_new_korona_updates => :environment do
  next if Date.today.wday == 2 && (3..11).to_a.include?(Time.now.utc.hour)
  s = ShopifyApi.last
  ProductPayload.where(processed: false).uniq { |f| JSON.parse(f.json_payload)["id"] }.each do |pp|
    params = JSON.parse(pp.json_payload)
    product_id = params["id"]
    variants = params["variants"]
    all_products = BaseProduct.where(shopify_product_id: product_id.to_s)
    # if the product has been updated to archived, destroy all records in the DB and in LS
    if params["status"] == "archived"
      all_products.each do |p|
        deletion = delete_k_product(id: p.light_id)
        puts '__________ARCHIVED PRODUCT_____________'
        puts deletion
        puts '__________ARCHIVED PRODUCT_____________'
        base_destroy = p.destroy
        puts '_________BASE_____________'
        puts base_destroy
        puts '_______BASE_______________'
      end
    else
      # create variants if not there
      variants.each do |v|
        product = all_products.find_by(shopify_variant_id: v["id"].to_s)

UPDATE "product_payloads" SET "processed" = $1  [["processed", true]]
---
      end
    end
  end
  ProductPayload.update_all(processed: true)