lib/tasks/store_single_del_copy.rake

SELECT "shopify_apis".* FROM "shopify_apis" ORDER BY "shopify_apis"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "product_payloads".* FROM "product_payloads" WHERE "product_payloads"."processed" = $1  [["processed", false]]
---
task :process_new_korona_updates => :environment do
  # next if Date.today.wday == 2 && (3..11).to_a.include?(Time.now.utc.hour
  s = ShopifyApi.last
  ProductPayload.where(processed: false).uniq { |f| JSON.parse(f.json_payload)["id"] }.each do |pp|

UPDATE "product_payloads" SET "processed" = $1  [["processed", true]]
---
      end
    end
  end
  ProductPayload.update_all(processed: true)